[{"ID":"315326","post_title":"Life Insurance for Expats","post_date":"2016-07-13 08:01:07","post_content":"[vc_row full_width=&quot;&quot; parallax=&quot;&quot; parallax_image=&quot;&quot; lvca_dark_bg=&quot;&quot;][vc_column width=&quot;1\/1&quot;][lvca_team style=&quot;style2&quot; per_line=&quot;1&quot;][lvca_team_member member_name=&quot;Martyn Davies and Matthew Arnold&quot; member_position=&quot;Austen Morris Associates&quot; member_details=&quot;Martyn Davies and Matthew Arnold are two extremely successful offshore financial advisers with a wealth of knowledge acquitted over the last two decades in the industry, with Martyn having worked for a number of years in South Africa and Dubai, while Matthew was based in China. They are both currently located in Manila and they now operate out of Austen Morris Associates, providing bespoke financial solutions to expatriate clients across the Asia region and beyond.\r\n&lt;label&gt;If you would like to contact Martyn and Matthew form further investment advice, please contact them at: &lt;strong&gt;martyn.d@austenmorris.com&lt;\/strong&gt;&lt;\/label&gt;&quot; member_image=&quot;277701&quot;][\/lvca_team][vc_separator color=&quot;grey&quot; align=&quot;align_center&quot; style=&quot;&quot; border_width=&quot;&quot; el_width=&quot;&quot;][vc_column_text]&lt;strong&gt;Do You Really Need Life Insurance?&lt;\/strong&gt;\r\n\r\nLet's answer this quickly by saying that if you have no dependents of any kind, and you're not an important part of a business, then you probably don't need life insurance. However, many adults &lt;strong&gt;do&lt;\/strong&gt; have dependents of various kinds - young children, spouse, partner, elderly parents, relatives or perhaps disabled relatives - who are not able to earn their own living.\r\nAlso, if you are the director\/owner of a business or if you have a key position within a business, life insurance can be a very important tool. We'll discuss this aspect later, but first let's have a look at family dependents.\r\n\r\n&lt;strong&gt;No time to think about life insurance?&lt;\/strong&gt;\r\n\r\nExpats are busy people, earning good salaries with benefits to match; few think about dying, or what would happen to their dependents if they were to pass away.\r\n\r\nIn addition, working away from their home countries, it's not always easy to find the correct advice, or even a company that will provide them with life insurance at all. So, unfortunately, I have met many expats who have either no life insurance, or totally inadequate life insurance to provide for their dependents.\r\n\r\n&lt;strong&gt;How much insurance cover is necessary?&lt;\/strong&gt;\r\n\r\nAfter realizing that you do need life insurance, the next question to ask is how much insurance cover do you need? You need to estimate your dependents' future needs, looking at living expenses, housing, education and other costs, up to the time that they are able to take care of themselves, if that is possible. However, in some cases, such as elderly, sick or disabled dependents, you might need to calculate for lifetime provision, and in each case you must make an estimate for future inflation. Here, we are considering long-term costs, but it's important to understand that some costs after an expat’s death will be short-term, such as funeral or repatriation costs. Also, please don't forget that you may have existing debts or a mortgage that need to be paid off too!\r\n\r\n&lt;strong&gt;What about short-term costs after death?&lt;\/strong&gt;\r\n\r\nThis leads onto the next point, namely, how long will dependents need to wait before receiving funds from your estate or insurance policy? If you die intestate (without a will in place), it could be a very long time indeed before your dependents are able to access funds; by the way, it cannot be stressed enough that it's very important for expats to have a will in place, both in their home country and also a second will in the country in which you are living. With or without a will, there needs to be a plan in place so that your dependents can immediately access sufficient funds to cover short-term costs.\r\n\r\n&lt;strong&gt;Existing assets and the shortfall.&lt;\/strong&gt;\r\n\r\nOnce you have estimated future costs, you need to calculate the total assets that might be available at the time of your death. The assets could come from a variety of sources, including savings, investment portfolios, pension funds, employer schemes or existing insurance policies. There may also be some kind of government support available, but it's never a good idea to rely on this, especially since governments around the world try to reduce their expenditures as much as possible. Once you know this information, you can see what capital is available, what income it could provide, and what the shortfall is between existing capital and your dependents’ future needs. Obviously, each expat has his or her own unique circumstances, but the shortfall should be considered for coverage by an insurance policy.\r\n\r\n&lt;strong&gt;Don't forget that your dependents may need to pay YOUR death taxes!&lt;\/strong&gt;\r\n\r\nMany expats have substantial assets and, depending on domicile, their estates may be liable for death taxes. This could be a problem for your dependent relatives as cash may not be readily available to pay these taxes; this may force them to sell assets such as the family home. This is another good reason for life insurance, as a policy can be put in place to cover most or all of these taxes.\r\n\r\n&lt;strong&gt;Business owners and key executives also need to think about life insurance.&lt;\/strong&gt;\r\n\r\nFinally, it's common for expats to be owners, part-owners or senior directors of businesses, and they should consider what will happen to those businesses in the event of their death. This is especially important in respect of continuing ownership and the immediate cash flow position of the company. In this case, life insurance can be put in place to enable inheritors, or remaining shareholders, to buy out the deceased person's shares or to provide cash flow while the business recovers.\r\n\r\nWhatever your circumstances, it could be useful to have a discussion with a professional, independent, financial advisor. They can help you work through the issues and create a life insurance solution that will be suitable for you and your dependents.\r\n\r\nIn any event, although it's a morbid subject, everybody should spend a little time to think about life-insurance, OR additional life-insurance! It might save a lot of grief later down the line.\r\n\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text]\r\n&lt;p style=&quot;text-align: right;&quot;&gt;&lt;a href=&quot;\/our-offshore-experts\/&quot;&gt;View previous articles&lt;\/a&gt;&lt;\/p&gt;\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n[\/vc_column_text][\/vc_column][\/vc_row]","post_excerpt":"Let's answer this quickly by saying that if you have no dependents of any kind, and you're not an important part of a business, then you probably don't need life insurance. However, many adults do have dependents of various kinds - young children, spouse, partner, elderly parents, relatives or perhaps disabled relatives - who are not able to earn their own living.","post_terms":"[]","guid":"http:\/\/www.marketmasterclass.com\/?p=315326","post_fmeta":null,"featured_image":"http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/07\/Life-Insurance-for-Expats.jpg"},{"ID":"276006","post_title":"The End of UK Based Pension Schemes?","post_date":"2016-06-02 02:41:15","post_content":"[vc_row full_width=&quot;&quot; parallax=&quot;&quot; parallax_image=&quot;&quot; lvca_dark_bg=&quot;&quot;][vc_column width=&quot;1\/1&quot;][lvca_team style=&quot;style2&quot; per_line=&quot;1&quot;][lvca_team_member member_name=&quot;Martyn Davies and Matthew Arnold&quot; member_position=&quot;Austen Morris Associates&quot; member_details=&quot;Martyn Davies and Matthew Arnold are two extremely successful offshore financial advisers with a wealth of knowledge acquitted over the last two decades in the industry, with Martyn having worked for a number of years in South Africa and Dubai, while Matthew was based in China. They are both currently located in Manila and they now operate out of Austen Morris Associates, providing bespoke financial solutions to expatriate clients across the Asia region and beyond.\r\n&lt;label&gt;If you would like to contact Martyn and Matthew form further investment advice, please contact them at: &lt;strong&gt;martyn.d@austenmorris.com&lt;\/strong&gt;&lt;\/label&gt;&quot; member_image=&quot;277701&quot;][\/lvca_team][vc_separator color=&quot;grey&quot; align=&quot;align_center&quot; style=&quot;&quot; border_width=&quot;&quot; el_width=&quot;&quot;][vc_column_text]We are all seeing more and more bad news stories regarding UK-based pension schemes, which is particularly prevalent in the defined benefit, or final salary, sector. New schemes have now all but died out due to the huge pressure that their funding puts on a company’s overall financial position, which has been driven primarily by rising life expectancy and record low returns on capital.\r\n\r\nThe aggregate deficit of the 5,945 schemes eligible for the Pension Protection Fund, the “lifeboat” scheme, was estimated at £270bn at the end of April, with 4,804 schemes in deficit and 1,141 schemes in surplus. There will be a major inquiry considering radical solutions to one of the great problems of this age, and the government is now considering a radical plan for the British Steel scheme which, with 130,000 members, is one of the largest private sector plans in the UK.\r\n\r\nThe consultation raises the prospect of billions of pounds being slashed from the long-term liabilities of the fund, which would be achieved in part by switching the indexation of pension increases from the RPI inflation index to the usually lower CPI measure. The government has said it is not considering extending the proposal, needed to allow the British Steel pension cuts, beyond that scheme.\r\n\r\nBut Mr Field said: “We should be under no illusions that British Steel was a special case. 11m people have private-defined benefit pensions. More than 5,000 of the associated schemes are in deficit to the tune of £805bn, while the combined surpluses of other schemes is £4bn.” He added: “This will be a major inquiry… the inquiry will consider, amongst other things, radical solutions that could be more easily implemented if real returns on capital rise again.”\r\n\r\nIn its consultation document published this week, the Department for Work and Pensions said it was aware that a number of other employers with defined benefit schemes had concerns about the size of their liabilities and the possible impacts on their sustainability as a business.\r\n\r\nIf you do have a UK-based defined benefit pension as part of your personal asset portfolio, it would be well worth seeking out a qualified pension expert to perform a free no-obligation pension health check. This should include a full and complete analysis of your current pension situation, which in many cases will include a number of schemes, as well as accounting for any other assets you hold which you would see as part of your pension planning.\r\n\r\nThere are many options available out there that would enable you to secure your and your family’s future financial security, most of which are offered in a far less volatile arena than the current UK pension sector.[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text]\r\n&lt;p style=&quot;text-align: right;&quot;&gt;&lt;a href=&quot;\/our-offshore-experts\/&quot;&gt;View previous articles&lt;\/a&gt;&lt;\/p&gt;\r\n\r\n[\/vc_column_text][\/vc_column][\/vc_row]","post_excerpt":"We are all seeing more and more bad news stories regarding UK-based pension schemes, which is particularly prevalent in the defined benefit, or final salary, sector. New schemes have now all but died out due to &lt;a href=&quot;\/our-offshore-experts\/the-end-of-uk-based-pension-schemes\/&quot; class=&quot;readmore&quot;&gt;Read More…&lt;\/a&gt;","post_terms":"[]","guid":"http:\/\/www.marketmasterclass.com\/?p=276006","post_fmeta":null,"featured_image":"http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/06\/oitvp1c6lqp1agh48avk.jpg"}]