[{"ID":"323940","post_title":"Bringing Home the Bacon","post_date":"2016-07-22 06:45:44","post_content":"[vc_row full_width=&quot;&quot; parallax=&quot;&quot; parallax_image=&quot;&quot; lvca_dark_bg=&quot;&quot;][vc_column width=&quot;1\/1&quot;][lvca_team style=&quot;style2&quot; per_line=&quot;1&quot;][lvca_team_member member_name=&quot;Bruce Curran&quot; member_image=&quot;272832&quot; member_position=&quot;Independent Investment Expert&quot; member_details=&quot;Bruce Curran has been advising companies and individuals in Asia about international fundinvestment for over 30 years. He was a Director of the Swire Group in Hong Kong and has written numerous financial articles for Merrill Lynch, The Security Bank, and The Billionaire Magazine, and he was also a regular columnist for the Business World newspaper as well as Time magazine. Now an Independent Financial Adviser, he is here to share his views, suggestions and recommendations with those curious about investment in this vast jungle of opportunities.&quot;][\/lvca_team][vc_separator color=&quot;grey&quot; align=&quot;align_center&quot; style=&quot;&quot; border_width=&quot;&quot; el_width=&quot;&quot;][vc_column_text]Bringing Home the Bacon\r\n\r\nProfiting from the Fat of the Land\r\n\r\nSince the meltdown in the investment markets some 30 years ago in 1987, there has been a lot of soul searching among fund companies to produce new and ritzy products that will suit the contemporary investor. The modern frame of operation takes place in a world where time and money is the essence, and making a quick buck is the preferred result.\r\n\r\nThe recent “meltdown” of late 2007 and early 2008, when the major banks held the world to ransom, has revived these issues, causing another rewriting of the rules, and has produced another brand of fund offerings that are necessary to fuel the fire of the gutsy investor.\r\n\r\n&lt;strong&gt;LIGHTNING STRIKES TWICE:&lt;\/strong&gt;\r\n\r\nThe fresh menu of fancy, fleet-footed, sophisticated and clever structures are a gourmet delight of recipes that are all tempered by a very large bright red carpet on the end of a golden stick. Large profit promises are the icing on the cake of a continual barrage of spicy offerings aimed at the nouveau riche and the deep pockets of those with money to burn.\r\n\r\n&lt;strong&gt;STORIES TO DIE FOR:&lt;\/strong&gt;\r\n\r\nWe hear them all the time…\r\n\r\n“Buy mining stocks. China is using all the minerals for their economic growth and cannot get enough.”\r\n\r\n“Buy gold… it always does well in a recession.”  Or, when there is major concern with currencies, like now in 2016 with the European Union upset caused by the UK Referendum vote to exit… at one stage, gold went up 12% during June alone! Now there’s a profit margin!\r\n\r\n“Buy commodities… look at the fast rising prices.”\r\n\r\n“Buy agricultural commodities… the price of rice has doubled in some years.”\r\n\r\nBuy, buy, buy….\r\n\r\nThese are all good stories, and make sense in their own little way.\r\n\r\nInvestors should of course take note and buy a little bit of this and a little bit of that, always doing the prudent thing to spread the risk and keep the investment eggs in several different asset baskets.\r\n\r\n&lt;strong&gt;DON’T KILL THE GOOSE THAT LAYS THE GOLDEN EGG:&lt;\/strong&gt;\r\n\r\nJust like all fields of activity, there are good eggs and bad eggs.\r\n&lt;ul&gt;\r\n\t&lt;li&gt;&lt;strong&gt;Hedging your Bets&lt;\/strong&gt;:&lt;\/li&gt;\r\n&lt;\/ul&gt;\r\n“A handful of Hedge Funds have lost money and failed so don’t invest in those things.”\r\n\r\nBut… the other handful have done incredibly well and exceeded expectations.\r\n&lt;ul&gt;\r\n\t&lt;li&gt;&lt;strong&gt;Stocks &amp;amp; Shares&lt;\/strong&gt;:&lt;\/li&gt;\r\n&lt;\/ul&gt;\r\n“Markets around the world have all collapsed. Get out of stocks now.”\r\n\r\nThis generalization is true, but there are dozens of little pockets of success under this vast umbrella, where niche markets are still doing brilliantly.\r\n&lt;ul&gt;\r\n\t&lt;li&gt;ALL EYES ON ASIA&lt;\/li&gt;\r\n&lt;\/ul&gt;\r\nThe focus of economic growth has slipped away from the paralysis now found in the USA, and Asia is the new kid on the economic block. The Gaming Industry is no exception and Macau now massively outstrips the old traditional center of Las Vegas, with Singapore and the Philippines as the other flag bearers. It is the obsession of the Chinese to gamble, and they are the main patrons.\r\n&lt;ul&gt;\r\n\t&lt;li&gt;THE OLD NOOSE&lt;\/li&gt;\r\n&lt;\/ul&gt;\r\nRemember the USA – that country that used to be the dynamo of all that was progressive, developmental and economically dynamic. That cutting-edge empire has definitively tripped up, slipped backwards, and is currently plunging into a quagmire of disrepute. A single country with its own brand of self-styled policing of the world, ruled by the hand of its own angelic brand of democracy and recently down on its knees, hiding behind the year-long game of who’s who in the political trivia arena. However, even in darkest North America, there are gleaming pockets of light - IT still looms large. The general opinion is that the State of the Nation is a fading image, far from the good old days when the USA was both king and boss and the omnipotent teacher\r\n&lt;ul&gt;\r\n\t&lt;li&gt;ASIA IS THE FUTURE&lt;\/li&gt;\r\n&lt;\/ul&gt;\r\nIt was the West that unleashed the economic revolution, but can Asian productivity and responsibility sift the corn from the chaff and pick out the good? Economic growth is one part of the jigsaw, but earth sensitivity is now the bigger picture and the golden piece in our survival. After all, there is that Mormon saying that “the earth is not given to us by our ancestors, it is borrowed from our children.”\r\n\r\nThese things will all have a bearing on investments over the coming months and years… it’s not all just about reading charts.[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n&lt;p style=&quot;text-align: right;&quot;&gt;&lt;a href=&quot;\/rogue-trader\/&quot;&gt;View previous articles&lt;\/a&gt;&lt;\/p&gt;\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n[\/vc_column_text][\/vc_column][\/vc_row]","post_excerpt":"Since the meltdown in the investment markets some 30 years ago in 1987, there has been a lot of soul searching among fund companies to produce new and ritzy products that will suit the contemporary investor. The modern frame of operation takes place in a world where time and money is the essence, and making a quick buck is the preferred result.","post_terms":"[]","guid":"http:\/\/www.marketmasterclass.com\/?p=323940","post_fmeta":null,"featured_image":"http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/07\/Bringing-Home-the-Bacon-.jpg"},{"ID":"318138","post_title":"Stocks - Making the Right Choice","post_date":"2016-07-15 05:19:17","post_content":"[vc_row full_width=&quot;&quot; parallax=&quot;&quot; parallax_image=&quot;&quot; lvca_dark_bg=&quot;&quot;][vc_column width=&quot;1\/1&quot;][lvca_team style=&quot;style2&quot; per_line=&quot;1&quot;][lvca_team_member member_name=&quot;Bruce Curran&quot; member_image=&quot;272832&quot; member_position=&quot;Independent Investment Expert&quot; member_details=&quot;Bruce Curran has been advising companies and individuals in Asia about international fundinvestment for over 30 years. He was a Director of the Swire Group in Hong Kong and has written numerous financial articles for Merrill Lynch, The Security Bank, and The Billionaire Magazine, and he was also a regular columnist for the Business World newspaper as well as Time magazine. Now an Independent Financial Adviser, he is here to share his views, suggestions and recommendations with those curious about investment in this vast jungle of opportunities.&quot;][\/lvca_team][vc_separator color=&quot;grey&quot; align=&quot;align_center&quot; style=&quot;&quot; border_width=&quot;&quot; el_width=&quot;&quot;][vc_column_text]&lt;strong&gt;Making the Right Choice&lt;\/strong&gt;\r\n\r\nBuying Stocks &amp;amp; Shares\r\n\r\n&lt;strong&gt;ADVICE&lt;\/strong&gt;: Take the plunge… dive into the best stock markets in the world, buy stocks and shares… it’s inevitable that they will definitely affect your wealth. This is all very well, but where to begin? Which markets do you choose? There are a million questions to consider. Here are but a few.\r\n\r\nAre things really flying in Brazil? Is mining in the Philippines about to collapse? Is China overcooked? Is the United States of America really bankrupt with its massive bond debts in the hands of China? Which sectors are the ones that will perform? Is it still IT, Commodities, Energy stocks, Consumables, Construction? Or perhaps it is time again for Communications?\r\n\r\nThe fact is the list is endless…\r\n\r\nWhat to buy, when to buy, where to buy, these are all million-dollar questions. Perhaps we should say “million yen questions” because, let’s face it, the US Dollar is clearly under threat from the Middle East. Ah, there we have it, which currency to invest in?\r\n\r\nBut let’s back-track a little, because the very first decision is actually “how to buy.”\r\n\r\nLuckily, there is a clear path to choose for the uninitiated, and this approach will also be taken by the experienced investor as part and parcel of a more sophisticated portfolio in an effort to spread the risk among a number of investment baskets.\r\n\r\nStep one is to look at the wide field of choice offered by Investment Funds; hundreds of stock market funds haggle for your attention. Fund managers, big and small, old and new, general and specialist, all wave their menu of choices at everyone in yet another quagmire of brilliance and confusion!\r\n\r\n&lt;strong&gt;INVESTMENT FUNDS: &lt;\/strong&gt;“When America sneezes the stock markets of the world catch a cold.”\r\n\r\nIn Europe, there has always been a stock market saying: “Sell in May and go away.”\r\n\r\nThe big wide world likes to think that it is independent of the USA, and, over the years, this has increasingly become the case. The world boasts of its resilience and gloats at the relatively feeble profits in North America. It is clear that Asia is booming, with China and India as market leaders in many areas, hosting between them 1\/3 of the world’s population. Then, something happens, and the ripples ensnare institutions and corporations around the globe. The press rubs salt on the open wound and the crisis festers. Then, just as we start believing that the world is doomed, the stock markets hit new record highs. All is forgiven and profits pour in again.\r\n\r\nThe fact is that the stock markets of the world, in a general sense, are indeed inter-linked, and when one big market falls, they all follow suit. It is an insipid cycle of intent.\r\n\r\nA Stock Market choice: &lt;strong&gt;RISK&lt;\/strong&gt;.\r\n\r\n“No pain, no gain” emphasizes the chances of winning or losing…\r\n\r\n&lt;em&gt;High Risk&lt;\/em&gt; - means lots of profit or lots of losses. Timing is everything. No one knows all the answers, but you can have a hunch based on a pile of percolated information. High risk works both ways – when things are good, the returns are fantastic.\r\n\r\n&lt;em&gt;Low Risk&lt;\/em&gt; – does not necessarily mean “small returns and small losses.” When times are good, low risk funds can also fatten the calf. But, generally, as long as money is not left to rot in safety in a plain bank account, then returns will be welcomed in the long run.\r\n\r\n&lt;strong&gt;TAKING THE PLUNGE IN ASIA&lt;\/strong&gt;:      Everyone has been jumping up and down over China, India and Russia, and no wonder, because the returns have been phenomenally good in recent times.\r\n\r\n&lt;em&gt;The conclusion&lt;\/em&gt;: If there is going to be growth in the world in general, it is going to be in Asia. Forget the sophisticated markets, go for the undeveloped and exotic countries. China is the brawn of Asia; India is the brain of Asia; and the Philippines is in the growing heart of Asia.\r\n\r\n&lt;strong&gt; &lt;\/strong&gt;[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n&lt;p style=&quot;text-align: right;&quot;&gt;&lt;a href=&quot;\/rogue-trader\/&quot;&gt;View previous articles&lt;\/a&gt;&lt;\/p&gt;\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n[\/vc_column_text][\/vc_column][\/vc_row]","post_excerpt":"","post_terms":"[]","guid":"http:\/\/www.marketmasterclass.com\/?p=318138","post_fmeta":null,"featured_image":"http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/07\/Making-the-Right-Choice.jpg"},{"ID":"313578","post_title":"Compounding and the Rule of 72","post_date":"2016-07-12 04:31:35","post_content":"[vc_row full_width=&quot;&quot; parallax=&quot;&quot; parallax_image=&quot;&quot; lvca_dark_bg=&quot;&quot;][vc_column width=&quot;1\/1&quot;][lvca_team style=&quot;style2&quot; per_line=&quot;1&quot;][lvca_team_member member_name=&quot;Bruce Curran&quot; member_image=&quot;272832&quot; member_position=&quot;Independent Investment Expert&quot; member_details=&quot;Bruce Curran has been advising companies and individuals in Asia about international fundinvestment for over 30 years. He was a Director of the Swire Group in Hong Kong and has written numerous financial articles for Merrill Lynch, The Security Bank, and The Billionaire Magazine, and he was also a regular columnist for the Business World newspaper as well as Time magazine. Now an Independent Financial Adviser, he is here to share his views, suggestions and recommendations with those curious about investment in this vast jungle of opportunities.&quot;][\/lvca_team][vc_separator color=&quot;grey&quot; align=&quot;align_center&quot; style=&quot;&quot; border_width=&quot;&quot; el_width=&quot;&quot;][vc_column_text]&lt;strong&gt;Taking the Plunge&lt;\/strong&gt;\r\n\r\nA lesson in how money works\r\n\r\nAre we really aware of that miracle of &lt;strong&gt;“compounding interest”&lt;\/strong&gt; and the &lt;strong&gt;Golden Rule of 72&lt;\/strong&gt;?\r\n\r\nEinstein described the miracle of compounding as “the greatest mathematical discovery of all time” and as “the eighth wonder of the world.” He definitely knew a thing or two about how the universe ticks.\r\n\r\nJohn Maynard Keynes, the economist genius, described it as “the awesome power of compound interest.”\r\n\r\nWhat amazed these men was the way in which, given enough time, even apparently trivial amounts of money can turn into spectacular fortunes. The reason is simple but profound.\r\n\r\nTake $1,000 and invest it wisely, grow it by 10% in a year, and, at the end of that year, you will have $1,100. Do the same for a second year and you will have not $1,200-but $1,210 because your 10% return on the starting $1,100 is worth $110. Do this every year for 20 years and the return in the last year will be worth $600 and the initial $1,000 will have turned into $6,700.\r\n\r\nNow imagine that, during the first year, you put aside another $1,000 (that is only $20 a week) and set it to work alongside the first $1,000. The 19 years during which it grows at 10% a year will turn it into $6,100. The third year’s $1,000 will grow to $5,600 in 18 years and so on … in 20 years you will have amassed $64,000 by simply saving $20 a week.\r\n\r\nThe beauty of compound interest is that the longer you can let it work its magic, the greater the rewards. Although it will take you 32 years to build this savings up to $500,000, by the time another 30 years has passed, your fund will have more than doubled to a grand sum of $1,100,000. Quite a tidy sum - and all that for so little weekly!\r\n\r\n&lt;em&gt;The motto is clearly “start saving now,” and do not delay…because compounding will work more in your favor the more time you have set aside for its magic.                  &lt;\/em&gt;\r\n\r\nOK, so now we know that we should start saving…but what is this &lt;strong&gt;Golden Rule of 72&lt;\/strong&gt;?\r\n\r\nTime can perform miracles with your modest savings, but then comes the revelation that if you can squeeze out a slightly better return than the 10%, then the returns are immensely     compounded. That is what the Golden Rule of 72 shows you. It is the formula for showing you how many years it will take you to double your money at a rate of compound interest.\r\n\r\nTo work this out, simply divide 72 by the interest rate you think you can achieve. At 7% it will take 10 years to double your money, while at 12% a year, it will take just 6 years.\r\n\r\nIn those last 30 years, after you have given up saving and your money is working hard while you sleep, you will double your money around four times over at just 10% a year (which is how you will get from $64,000 to $1,100,000). BUT, at 15% a year you would do it twice more again, which would turn $1,100,000 into $4,400,000.\r\n\r\nSo, now all you need to do is find investments which get you a return of 10%-15% a year.     &lt;em&gt;                                                                                                                                                                                                                        &lt;\/em&gt;[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n&lt;p style=&quot;text-align: right;&quot;&gt;&lt;a href=&quot;\/rogue-trader\/&quot;&gt;View previous articles&lt;\/a&gt;&lt;\/p&gt;\r\n\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n[\/vc_column_text][\/vc_column][\/vc_row]","post_excerpt":"","post_terms":"[]","guid":"http:\/\/www.marketmasterclass.com\/?p=313578","post_fmeta":null,"featured_image":"http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/07\/Compounding-and-the-Rule-of-72.jpg"},{"ID":"309251","post_title":"The Profitable Discipline - Monthly Averaging","post_date":"2016-07-08 05:43:33","post_content":"[vc_row full_width=&quot;&quot; parallax=&quot;&quot; parallax_image=&quot;&quot; lvca_dark_bg=&quot;&quot;][vc_column width=&quot;1\/1&quot;][lvca_team style=&quot;style2&quot; per_line=&quot;1&quot;][lvca_team_member member_name=&quot;Bruce Curran&quot; member_image=&quot;272832&quot; member_position=&quot;Independent Investment Expert&quot; member_details=&quot;Bruce Curran has been advising companies and individuals in Asia about international fundinvestment for over 30 years. He was a Director of the Swire Group in Hong Kong and has written numerous financial articles for Merrill Lynch, The Security Bank, and The Billionaire Magazine, and he was also a regular columnist for the Business World newspaper as well as Time magazine. Now an Independent Financial Adviser, he is here to share his views, suggestions and recommendations with those curious about investment in this vast jungle of opportunities.&quot;][\/lvca_team][vc_separator color=&quot;grey&quot; align=&quot;align_center&quot; style=&quot;&quot; border_width=&quot;&quot; el_width=&quot;&quot;][vc_column_text]\r\n\r\n&lt;strong&gt;The Profitable Discipline&lt;\/strong&gt;\r\n\r\nThe Great Investment Advantage\r\n\r\nRecessions and falling markets are a wonderful thing… at least for those lining up to start a regular savings plan. Low prices mean lots of cheap shares, and this brings into play the magic of the so called &lt;strong&gt;“dollar-cost averaging.”&lt;\/strong&gt;\r\n\r\n&lt;strong&gt;DOLLAR COST AVERAGING&lt;\/strong&gt;\r\n\r\nPerhaps one of the most effective methods of investing in stocks and shares, mutual funds, or unit trusts is to set up a regular savings plan with a reputable offshore company. In doing so, you not only start on the road to financial security, you will also gain access to the powerful effects of dollar-cost averaging.\r\n\r\n&lt;strong&gt;Smoothing out market movement&lt;\/strong&gt;\r\n\r\nPutting away a predetermined amount of money on a regular basis is a proven way to pursue the accumulation of wealth over time. But the strategy – called dollar-cost averaging – produces other benefits as well:\r\n\r\n&lt;strong&gt;Encourages discipline&lt;\/strong&gt;\r\n\r\nOnce you have begun, it serves as a strong reminder to invest at the appointed time.\r\n\r\n&lt;strong&gt;Eliminates the need to decide when to invest&lt;\/strong&gt;\r\n\r\nWhen it’s time to invest, you do so, regardless of what is going on in the market.\r\n\r\n&lt;strong&gt;Avoids the temptation to time the market&lt;\/strong&gt;\r\n\r\nSome investors cannot resist the urge to try to invest at a market low and take their profits at a market high; they usually fail because the task is virtually impossible, even for the experts.\r\n\r\n&lt;strong&gt;How Dollar-Cost Averaging Works:&lt;\/strong&gt;\r\n\r\nThe object is to invest a set amount of money into the same stock at regular intervals so the average cost of shares tends to even out the market’s peaks and troughs. Your dollars purchase fewer shares when the market is up, but they buy more when it’s down. While you may not achieve the positive results of buying at the market’s low point and selling at its high point, neither will you suffer the consequences of doing the opposite. On the average, in a generally rising market, you have the opportunity to accumulate wealth over time in a systematic, organised way.\r\n\r\n&lt;strong&gt;FOUR THINGS TO REMEMBER ABOUT DOLLAR-COST AVERAGING:&lt;\/strong&gt;\r\n\r\n&lt;strong&gt;In the long run, it doesn’t matter when you start, just that you do start.&lt;\/strong&gt;\r\n\r\nOver a long enough period, it makes little difference whether the market was up or down when you began.\r\n\r\n&lt;strong&gt;Making monthly additions to your account allows you three times as many opportunities to benefit from favourable market swings as investing on a quarterly basis.&lt;\/strong&gt;\r\n\r\nThe more frequently you invest and the longer you keep investing, the smoother the average-share-cost line becomes.\r\n\r\n&lt;strong&gt;A market decline can mean bargain prices&lt;\/strong&gt;\r\n\r\nUnless you are selling shares, a fund’s price quote in the daily paper is not relevant for anyone who is not planning to sell, so don’t panic if it is down. In fact, a downturn provides the opportunity to buy more shares at attractive prices and which have the potential to grow in value when the market finally turns upward.\r\n\r\n&lt;strong&gt;Be prepared to weather a sustained market decline&lt;\/strong&gt;\r\n\r\nKeep in mind that in order for dollar-cost averaging to work, you must be prepared to commit financial resources and have the resolve to make the contributions on each appointed date. Regular investing does not ensure a profit and does not protect against loss in declining markets; investors should consider their ability to invest continuously during periods of fluctuating price levels.\r\n\r\n&lt;strong&gt; &lt;\/strong&gt;\r\n\r\n&lt;strong&gt;Savings Plans – there is profit in discipline!&lt;\/strong&gt;\r\n\r\nRegular savings plans, preferably monthly-funded, thrive on volatility and the roller-coaster times of recession and falling markets. At the end of the road, in a year or three, everything starts flying high again and all those months of purchasing shares at low prices means a massive accumulation of cheap shares. When the investment up-cycle returns, the profit sun starts shining again, and the army of shares all march onwards and upwards, and profits flood in… patience and perseverance are the name of the game in the &lt;strong&gt;Great Investment Advantage.&lt;\/strong&gt;\r\n\r\nNow is definitely the time… do not delay![\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n&lt;p style=&quot;text-align: right;&quot;&gt;&lt;a href=&quot;\/rogue-trader\/&quot;&gt;View previous articles&lt;\/a&gt;&lt;\/p&gt;\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n[\/vc_column_text][\/vc_column][\/vc_row]","post_excerpt":"","post_terms":"[]","guid":"http:\/\/www.marketmasterclass.com\/?p=309251","post_fmeta":null,"featured_image":"http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/07\/Profitable-Discipline.jpg"},{"ID":"305502","post_title":"Wanted – Financial Independence","post_date":"2016-07-05 04:47:11","post_content":"[vc_row full_width=&quot;&quot; parallax=&quot;&quot; parallax_image=&quot;&quot; lvca_dark_bg=&quot;&quot;][vc_column width=&quot;1\/1&quot;][lvca_team style=&quot;style2&quot; per_line=&quot;1&quot;][lvca_team_member member_name=&quot;Bruce Curran&quot; member_image=&quot;272832&quot; member_position=&quot;Independent Investment Expert&quot; member_details=&quot;Bruce Curran has been advising companies and individuals in Asia about international fundinvestment for over 30 years. He was a Director of the Swire Group in Hong Kong and has written numerous financial articles for Merrill Lynch, The Security Bank, and The Billionaire Magazine, and he was also a regular columnist for the Business World newspaper as well as Time magazine. Now an Independent Financial Adviser, he is here to share his views, suggestions and recommendations with those curious about investment in this vast jungle of opportunities.&quot;][\/lvca_team][vc_separator color=&quot;grey&quot; align=&quot;align_center&quot; style=&quot;&quot; border_width=&quot;&quot; el_width=&quot;&quot;][vc_column_text]\r\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;strong&gt;WANTED – Financial Independence&lt;\/strong&gt;&lt;\/p&gt;\r\nThe older world calls it “retirement,” which has several depressing connotations associated with it, like it’s the end of the line, the end of an income stream, and that it’s maybe time to do the gardening.\r\n\r\nGet Smart. Plan for a rainy day, plan for a lazy day, or that day when you don’t actually have to get off the beach, because commitments are secondary in that carefully planned “job-free” zone of life in retirement.\r\n\r\nAt the end of the day, it all depends on the individual’s will and willingness. It used to be that with the “good old” companies, a pension plan was part and parcel of the employment package… but, these days, more often than not, individuals have to make their own plans for money in retirement.\r\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;strong&gt;“I’m too young to think about retiring.”&lt;\/strong&gt;&lt;\/p&gt;\r\nFor many people, the decision to save for a pension is the most important investment decision they will ever make. Retirement may currently seem remote to you with other day-to-day financial demands seemingly more pressing. Yet, undertaking a simple and flexible retirement program, whatever your present age or future plans, is a wise and rewarding decision.\r\n&lt;p style=&quot;text-align: left;&quot;&gt;“O&lt;strong&gt;r am I?”                                             &lt;\/strong&gt;&lt;\/p&gt;\r\nIncreasing longevity, earlier retirement and higher expectations in retirement are all compounding to heighten the need to plan more effectively the financing of those “golden years.” Imagine for a moment how you would feel if, after a lifetime of work, you had insufficient funds to enjoy your hard-earned retirement.\r\n\r\nOne of the leading providers of international retirement plans estimates that an individual with a salary of $35,000 a year, with full pension entitlement, would receive a pension of 23% of pre-retirement income, which is a 77% fall in income. A report published by the Office of Fair Trading in the UK stated that in order to receive a pension targeted at two thirds of final salary at age 65, individuals would need to save a high proportion of their income each year until retirement. The amount required depends on whether or not they already have savings:\r\n\r\nThese figures show you what percentage you need to save in order to receive a retirement income equal to two thirds of the final year of a working salary.\r\n\r\nIf you started saving…\r\n\r\nAt age 25, you would need to save 10% of your income ever year till retirement.\r\n\r\nAt 30 - 13%\r\n\r\nAt 40 - 23%\r\n\r\nAt 50 - 46%\r\n\r\nAt 60 - 74%\r\n\r\nIt is clear from these figures what the “cost of delay” can be if you do not save early in life. Take note that if you wait till your 50s to start a plan, you might have to save 50% of your income to get yourself a sensible pension income. Ridiculous, you might say…but how much are you saving these days?\r\n\r\nIt is clear and obvious that the time to start a pension plan is as early as possible, and if you have not already started, then now is the time to begin.\r\n\r\n&lt;strong&gt;THE AGE OLD QUESTION&lt;\/strong&gt;\r\n\r\nThe sources of pensions needed to meet our higher expectations are becoming less and less certain. Additionally, many existing company schemes penalize employees in respect of the employer’s contributions if they leave with only a few years of service.\r\n\r\nThe alternative is to start investing your money and making it grow. Seek expert know-how and give yourself the opportunity to make informed decisions based on sound advice.\r\n\r\nAfter all, it is said that &lt;strong&gt;“if you fail to plan…you plan to fail!”&lt;\/strong&gt;\r\n\r\nSave now, or invest, for a better future.\r\n\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n&lt;p style=&quot;text-align: right;&quot;&gt;&lt;a href=&quot;\/rogue-trader\/&quot;&gt;View previous articles&lt;\/a&gt;&lt;\/p&gt;\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n[\/vc_column_text][\/vc_column][\/vc_row]","post_excerpt":"","post_terms":"[]","guid":"http:\/\/www.marketmasterclass.com\/?p=305502","post_fmeta":null,"featured_image":"http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/07\/Financial-Independence.jpg"},{"ID":"301667","post_title":"Brexit - A Key To A New Europe","post_date":"2016-07-01 04:29:49","post_content":"[vc_row full_width=&quot;&quot; parallax=&quot;&quot; parallax_image=&quot;&quot; lvca_dark_bg=&quot;&quot;][vc_column width=&quot;1\/1&quot;][lvca_team style=&quot;style2&quot; per_line=&quot;1&quot;][lvca_team_member member_name=&quot;Bruce Curran&quot; member_image=&quot;272832&quot; member_position=&quot;Independent Investment Expert&quot; member_details=&quot;Bruce Curran has been advising companies and individuals in Asia about international fundinvestment for over 30 years. He was a Director of the Swire Group in Hong Kong and has written numerous financial articles for Merrill Lynch, The Security Bank, and The Billionaire Magazine, and he was also a regular columnist for the Business World newspaper as well as Time magazine. Now an Independent Financial Adviser, he is here to share his views, suggestions and recommendations with those curious about investment in this vast jungle of opportunities.&quot;][\/lvca_team][vc_separator color=&quot;grey&quot; align=&quot;align_center&quot; style=&quot;&quot; border_width=&quot;&quot; el_width=&quot;&quot;][vc_column_text]The Brexit Referendum vote for The United Kingdom to stay or leave the European Union was taken on 23&lt;sup&gt;rd&lt;\/sup&gt; June. The vote was very close, and it turned out that England and Wales were all for leaving, while Scotland and Northern Ireland voted to stay. The divisions in the country were an eye opener, and it was a shock to the British Prime Minister Mr Cameron, who was all for staying, but, despite his country-wide contacts, the United Kingdom population decided otherwise. Last Friday the UK sterling dollar exchange rate was its lowest for 31 years.\r\n\r\nThe result caused a swarm of downturns in markets in many places around the world. The London Stock Market had a brutal two-day slide, and global stock markets lost about $2 trillion in value on the day after the voting results were announced -the biggest one-day loss ever. Money poured into the safe havens of Gold and Government Bonds, Spot Gold rising 4%, while the yield on the benchmark 10-year US Treasury note fell to a low of 1.406 %, the lowest since 2012.\r\n\r\nThe Frankfurt Exchange was down 7% and Paris down 8%, while Italy and Spain both had their sharpest one-day drops ever, both down 12%, with some bank stocks falling as much as 20%. The extraordinary market reactions briefly looked as though the end of the economic world had arrived, with British banks suffering massively in particular.\r\n\r\nVoting was actually extremely close, with 51.9% for leaving, but all in all this leaves the UK on an unknown path, and it’s certainly a massive setback to European unity.\r\n\r\nAs a back-up, the Bank of England, together with the European Central Bank, as well as the People’s Bank of China, all agreed to provide liquidity to ensure global market stability.\r\n\r\nThe Japanese Yen, traditionally a safe haven, was up 3.8% against the US Dollar, while Emerging Market currencies across Asia, Eastern Europe and also South Africa plummeted when the Brexit results were announced. The Federal reserve in the US is now unlikely to hike interest rates as a direct reaction to what changes are now happening in Europe.\r\n\r\nIn other initial reactions, oil fell 5% and copper sank 1.7%.\r\n\r\nBut, now that the ‘cat is out of the bag’, and the negative reactions to the Brexit have taken their toll, there is more calm and positivity flooding back into the markets, and the new Europe, working together with Britain, must look at all the advantages and the benefits of the new age, the revitalising of Europe, and the economic growth of the region generally.\r\n\r\nThe British government have the last say, and even though the people have voted to leave, Parliament will decide whether this will become the new reality. Also, it will take quite some time for Britain to exit the EU, assuming that this is the final decision, taking up to a couple of years according to some accounts. Then, British trade can flourish on its own footing without the shackles of Brussels.\r\n\r\nUS President Barack Obama has also got in on the act saying that he expects the world economy will be steady in the short run after Britain's decision but expressed concern about longer-term global growth.\r\n\r\nOne interesting fact emerged during the Brexit Referendum; in the heart of Europe, Gibraltar, also part of the United Kingdom, voted 96% to stay in the European Union. Gibraltar's Chief Minister, Fabian Picardo, is exploring options to keep the Territory in the EU despite the referendum.\r\n\r\n&quot;There are potentially different formulas out there, this is like a kaleidoscope that has not yet settled,&quot; he told the BBC.\r\n\r\nOverall the Brexit has caused a massive shake up, and a chance for everyone to have a re-think about the economic future of a thriving Europe. Britain will link in, and will still be a vital force in the European arena. The Brexit vote was definitively an eye-opener, and now that the storm has blown over, all countries in Europe can get back to business. Britain will share in their dynamic future.\r\n\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n&lt;p style=&quot;text-align: right;&quot;&gt;&lt;a href=&quot;\/rogue-trader\/&quot;&gt;View previous articles&lt;\/a&gt;&lt;\/p&gt;\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n[\/vc_column_text][\/vc_column][\/vc_row]","post_excerpt":"","post_terms":"[]","guid":"http:\/\/www.marketmasterclass.com\/?p=301667","post_fmeta":null,"featured_image":"http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/07\/Brexit-A-Key-To-A-New-Europe-.jpg"},{"ID":"294358","post_title":"Russia in Vogue","post_date":"2016-06-24 05:55:00","post_content":"[vc_row full_width=&quot;&quot; parallax=&quot;&quot; parallax_image=&quot;&quot; lvca_dark_bg=&quot;&quot;][vc_column width=&quot;1\/1&quot;][lvca_team style=&quot;style2&quot; per_line=&quot;1&quot;][lvca_team_member member_name=&quot;Bruce Curran&quot; member_image=&quot;272832&quot; member_position=&quot;Independent Investment Expert&quot; member_details=&quot;Bruce Curran has been advising companies and individuals in Asia about international fundinvestment for over 30 years. He was a Director of the Swire Group in Hong Kong and has written numerous financial articles for Merrill Lynch, The Security Bank, and The Billionaire Magazine, and he was also a regular columnist for the Business World newspaper as well as Time magazine. Now an Independent Financial Adviser, he is here to share his views, suggestions and recommendations with those curious about investment in this vast jungle of opportunities.&quot;][\/lvca_team][vc_separator color=&quot;grey&quot; align=&quot;align_center&quot; style=&quot;&quot; border_width=&quot;&quot; el_width=&quot;&quot;][vc_column_text]&lt;strong&gt;Russia Back In Vogue&lt;\/strong&gt;\r\n\r\nRussia has recently slipped back into the limelight, and is worth a medium term investment with 5% of an overall portfolio.\r\n\r\n&amp;nbsp;\r\n\r\n&lt;strong&gt;Fund Facts&lt;\/strong&gt;\r\n\r\nFund Name: Russian Federation First Mercantile Fund\r\n\r\nInvestment Manager: FMG\r\n\r\nCustodian: Credit Suisse\r\n\r\nDomicile: Bermuda\r\n\r\nAuditors: Grant Thornton\r\n\r\nRegulator: Bermuda Monetary Authority\r\n&lt;ul&gt;\r\n\t&lt;li&gt;Weekly liquidity&lt;\/li&gt;\r\n\t&lt;li&gt;Minimum Investment US$10,000 (or currency equivalent)&lt;\/li&gt;\r\n\t&lt;li&gt;Available in USD, EUR and GBP&lt;\/li&gt;\r\n&lt;\/ul&gt;\r\n&amp;nbsp;\r\n\r\nFund Objective:\r\n\r\nTo maintain a portfolio consisting of approximately 50% of its assets in Russia’s largest companies and 50% in Russian and other growing small-cap and mid-cap companies.\r\n\r\n&amp;nbsp;\r\n\r\nCumulative Performance\r\n&lt;table id=&quot;cp-table&quot;&gt;\r\n&lt;tbody&gt;\r\n&lt;tr&gt;\r\n&lt;th&gt;&lt;\/th&gt;\r\n&lt;th&gt;%YTD&lt;\/th&gt;\r\n&lt;th&gt;3 mths&lt;\/th&gt;\r\n&lt;th&gt;6 mths&lt;\/th&gt;\r\n&lt;th&gt;1 yr&lt;\/th&gt;\r\n&lt;th&gt;3 yrs&lt;\/th&gt;\r\n&lt;th&gt;5 yrs&lt;\/th&gt;\r\n&lt;\/tr&gt;\r\n&lt;tr&gt;\r\n&lt;td&gt;Fund&lt;\/td&gt;\r\n&lt;td&gt;+27.80&lt;\/td&gt;\r\n&lt;td&gt;14.14&lt;\/td&gt;\r\n&lt;td&gt;12.77&lt;\/td&gt;\r\n&lt;td&gt;9.29&lt;\/td&gt;\r\n&lt;td&gt;-27.05&lt;\/td&gt;\r\n&lt;td&gt;-45.77&lt;\/td&gt;\r\n&lt;\/tr&gt;\r\n&lt;tr&gt;\r\n&lt;td&gt;Sector&lt;\/td&gt;\r\n&lt;td&gt;4.07&lt;\/td&gt;\r\n&lt;td&gt;7.98&lt;\/td&gt;\r\n&lt;td&gt;2.84&lt;\/td&gt;\r\n&lt;td&gt;-2.11&lt;\/td&gt;\r\n&lt;td&gt;6.67&lt;\/td&gt;\r\n&lt;td&gt;0.33&lt;\/td&gt;\r\n&lt;\/tr&gt;\r\n&lt;\/tbody&gt;\r\n&lt;\/table&gt;\r\n&amp;nbsp;\r\n\r\nSector Breakdown\r\n\r\n&lt;img class=&quot;aligncenter size-full wp-image-294374&quot; src=&quot;http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/06\/Picture1.png&quot; alt=&quot;Picture1&quot; width=&quot;397&quot; height=&quot;241&quot; \/&gt;\r\n\r\n&lt;img class=&quot;aligncenter size-full wp-image-294396&quot; src=&quot;http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/06\/sectorbreakdown.png&quot; alt=&quot;sectorbreakdown&quot; width=&quot;468&quot; height=&quot;201&quot; \/&gt;\r\n\r\n&lt;strong&gt;Background&lt;\/strong&gt;\r\n\r\nIn September 1995 FMG was one of the earliest fund companies to launch a Russia fund. Russia is the largest oil producer in the world, producing an average of 10.3 million barrels of oil per day, totaling an average of 3.8 billion barrels a year. It produces 12.9% of the world’s oil and has 25% of the natural gas production.\r\n\r\n&lt;strong&gt;Russia at a Glance&lt;\/strong&gt;\r\n&lt;ul&gt;\r\n\t&lt;li&gt;&lt;strong&gt; Equities are trading at very low valuations&lt;\/strong&gt;\r\n&lt;strong&gt;•   One of the largest and fastest growing consumer markets&lt;\/strong&gt;\r\n&lt;strong&gt;•   Solid balance sheet and very low public debt&lt;\/strong&gt;\r\n&lt;strong&gt;•   Unique geographic position and vast natural resources&lt;\/strong&gt;&lt;\/li&gt;\r\n&lt;\/ul&gt;\r\n&amp;nbsp;\r\n\r\n&lt;strong&gt;Russia is Moving Up!&lt;\/strong&gt;\r\n&lt;ul&gt;\r\n\t&lt;li&gt;Despite massive swings in the key Russian commodity, namely crude oil, Russian equities were able to produce a stellar return of 14% for the first three months of the year.&lt;\/li&gt;\r\n\t&lt;li&gt;Largest positions are in blue chips such as Lukoil, Sberbank, Gazprom and Rosneft.&lt;\/li&gt;\r\n&lt;\/ul&gt;\r\n&amp;nbsp;\r\n\r\n&lt;strong&gt;FUND DESCRIPTION&lt;\/strong&gt;\r\n\r\nThe investment objective of the Russian Federation First Mercantile Fund is to achieve long term capital appreciation utilizing a concentrated sector strategy investment approach. The Fund Manager has significant experience gained over many years of investing in Russian companies.\r\n\r\n&amp;nbsp;\r\n\r\nThe Fund invests mainly in shares of companies with short and long term profit opportunities fuelled by export and domestic consumption and investment within Russia. Fundamental analysis is utilized to source attractively priced companies with significant earnings potential, while a quantitative technical model to determine allocations could be applied from time to time.\r\n\r\n&amp;nbsp;\r\n\r\nThe Fund can invest in a wide ranging sector of large and medium sized value- and growth-oriented companies and it also offers investors efficient access to the Russian stock market. Risk management and fund liquidity is an integral element of the portfolio management process, while the fund is well diversified geographically and among different industry sectors. The opportunistic nature of the fund targets investors with a higher risk-reward return profile, and who wish to tap into the world’s largest oil producer.\r\n\r\n&amp;nbsp;\r\n\r\nThe Russian Federation First Mercantile Fund offers investors direct and efficient access to the Russian stock market.[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n&lt;p style=&quot;text-align: right;&quot;&gt;&lt;a href=&quot;\/rogue-trader\/&quot;&gt;View previous articles&lt;\/a&gt;&lt;\/p&gt;\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text css_animation=&quot;&quot;]\r\n[\/vc_column_text][\/vc_column][\/vc_row]","post_excerpt":"","post_terms":"[]","guid":"http:\/\/www.marketmasterclass.com\/?p=294358","post_fmeta":null,"featured_image":"http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/06\/russia.jpg"},{"ID":"272808","post_title":"Making a Golden Choice","post_date":"2016-05-27 05:57:51","post_content":"[vc_row full_width=&quot;&quot; parallax=&quot;&quot; parallax_image=&quot;&quot; lvca_dark_bg=&quot;&quot;][vc_column width=&quot;1\/1&quot;][lvca_team style=&quot;style2&quot; per_line=&quot;1&quot;][lvca_team_member member_name=&quot;Bruce Curran&quot; member_image=&quot;272832&quot; member_position=&quot;Independent Investment Expert&quot; member_details=&quot;Bruce Curran has been advising companies and individuals in Asia about international fundinvestment for over 30 years. He was a Director of the Swire Group in Hong Kong and has written numerous financial articles for Merrill Lynch, The Security Bank, and The Billionaire Magazine, and he was also a regular columnist for the Business World newspaper as well as Time magazine. Now an Independent Financial Adviser, he is here to share his views, suggestions and recommendations with those curious about investment in this vast jungle of opportunities.&quot;][\/lvca_team][vc_separator color=&quot;grey&quot; align=&quot;align_center&quot;][vc_column_text]&lt;strong&gt; &lt;\/strong&gt;Gold is a classic asset class that is well worth considering for investing 5% of an overall portfolio.\r\n\r\n&lt;strong&gt;Fund Facts&lt;\/strong&gt;\r\n\r\n&lt;strong&gt;Fund Name: Aliquot Gold Bullion Inc.&lt;\/strong&gt;\r\n\r\n&lt;strong&gt;Investment Manager: Castlestone Management Inc.&lt;\/strong&gt;\r\n\r\n&lt;strong&gt;Custodian: Barclays Capital&lt;\/strong&gt;\r\n\r\n&lt;strong&gt;Domicile: British Virgin Islands&lt;\/strong&gt;\r\n\r\n&lt;strong&gt;Auditors: Deloitte Accountants&lt;\/strong&gt;\r\n\r\n&lt;strong&gt;Regulator: British Virgin Islands Financial Services Commission&lt;\/strong&gt;\r\n\r\n&lt;strong&gt;The Fund:&lt;\/strong&gt;\r\n&lt;ul&gt;\r\n\t&lt;li&gt;&lt;strong&gt;Aims to provide unleveraged, direct exposure to physical gold bullion&lt;\/strong&gt;&lt;\/li&gt;\r\n\t&lt;li&gt;&lt;strong&gt;No equity exposure and no corporate risk, the Fund only holds the physical metal&lt;\/strong&gt;&lt;\/li&gt;\r\n\t&lt;li&gt;&lt;strong&gt;Daily liquidity&lt;\/strong&gt;&lt;\/li&gt;\r\n\t&lt;li&gt;&lt;strong&gt;Available in USD, EUR and GBP&lt;\/strong&gt;&lt;\/li&gt;\r\n\t&lt;li&gt;&lt;strong&gt;Minimum Investment 10,000 in all 3 currencies&lt;\/strong&gt;&lt;\/li&gt;\r\n&lt;\/ul&gt;\r\n&lt;strong&gt; &lt;\/strong&gt;\r\n\r\n&lt;strong&gt;Why invest in Gold Bullion?&lt;\/strong&gt;\r\n\r\nGold is a ‘safe-haven’ asset in times of economic and geopolitical uncertainty, and in price sensitive and reactionary markets. The production cost for an ounce of gold is estimated to be in the $1200 range. Currently the price is well above this and there is a strong possibility of further price rises.  If HSBC are to be believed, they are claiming the price could rise to $1500.\r\n\r\n&amp;nbsp;\r\n\r\nThere is a strong correlation between gold prices and the increase in money supply. Gold can be the hedge against inflation, against the devaluation of money and also against low or negative interest rates. It is often used as a hedge against Central Bank intervention.\r\n\r\n&amp;nbsp;\r\n\r\nThe rising demand from emerging market countries, Central Banks and other investment houses, is expected to continue to keep gold prices buoyant.\r\n\r\nGold is uncorrelated to other asset classes, provides diversification and broadens the frontier of a diversified portfolio.\r\n\r\n&amp;nbsp;\r\n\r\n&lt;strong&gt;Gold Hitting New Highs.&lt;\/strong&gt;\r\n\r\n&lt;strong&gt; &lt;\/strong&gt;\r\n\r\n&lt;a href=&quot;http:\/\/www.ft.com\/topics\/themes\/Gold&quot;&gt;Gold&lt;\/a&gt; is currently a very telling, positive and compelling story. Sentiment remains strong with Gold pricing hitting a 15-month high by the end of April, with the previous week showing a gain of 4.7%, the highest percentage move since early February.\r\n\r\n&amp;nbsp;\r\n\r\nThe biggest shift in sentiment has been among market professionals. Out of 36 market experts contacted, 21 responded, of which 15 professionals, or 71%, said they are ‘bullish’ on gold; at the same time five professionals, or 29%, said they are bearish. No analyst was neutral on the market.  Market participants include bullion dealers, investment banks, futures traders and technical-chart analysts.\r\n\r\n&amp;nbsp;\r\n\r\n&lt;strong&gt;Market Analysts Bullish on Gold.&lt;\/strong&gt;\r\n\r\n&amp;nbsp;\r\n\r\nAccording to comments from market participants, many are bullish on gold as the U.S. dollar is expected to push lower with the Federal Reserve expected to keep interest rates static.\r\n\r\n“With the dollar falling, we are seeing a manic move into gold by those who are short or on the sidelines,” said Adrian Day, President of Adrian Day Asset Management.\r\n\r\nColin Ciesznski, senior market strategist at CMC Markets, said that, along with a weaker U.S. dollar as other currencies catch up due to shifting global monetary policies, the technical picture for gold has significantly improved. “This week’s rally called off a head-and-shoulders top that had been forming, a bullish sign,” he said.\r\n\r\nEven the bearish analysts remain optimistic that gold will continue to hold most of its recent gains. Richard Baker, editor of the Eureka Miner newsletter, said that he could see prices fall back and take a breather next week following the latest rally.\r\n\r\nAfter four years of sharp falls, a sudden revival has been taking place in the Gold market. In the first three months of 2016 the price of the yellow metal soared by 20% - its best quarterly performance since the financial crisis erupted in the final three months of 2008.\r\n\r\n&amp;nbsp;\r\n\r\nThe gold price, around $1,260 an ounce, is well below its record peak of almost $1,900 achieved in July 2011, at the height of the European sovereign debt crisis.\r\n\r\n&amp;nbsp;\r\n\r\nFor investors who have missed out on the rally so far, the big question is: has gold turned a corner, suggesting that it will continue to rise, or will it crash back down to earth?\r\n\r\n&lt;strong&gt; &lt;\/strong&gt;\r\n\r\n&lt;strong&gt;Who has been buying gold?&lt;\/strong&gt;\r\n\r\n&amp;nbsp;\r\n\r\nCentral banks are among the buyers, but, more importantly, according to Charles Morris, who edits the AtlasPulse Report gold newsletter, there has been a change in sentiment from investors, private as well as institutional.\r\n\r\n“Changes in investor interest explain 80% of the move in the gold price.”\r\n\r\n&amp;nbsp;\r\n\r\n&lt;strong&gt;The time to buy is now!&lt;\/strong&gt;\r\n\r\n&lt;strong&gt; &lt;\/strong&gt;\r\n\r\nGold is the precious metal currently hitting the headlines, and will always have a place in a well-diversified personal portfolio.[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text]\r\n&lt;p style=&quot;text-align: right;&quot;&gt;&lt;a href=&quot;\/rogue-trader\/&quot;&gt;View previous articles&lt;\/a&gt;&lt;\/p&gt;\r\n[\/vc_column_text][\/vc_column][vc_column width=&quot;1\/1&quot;][vc_column_text]\r\n[\/vc_column_text][\/vc_column][\/vc_row]","post_excerpt":" Gold is a classic asset class that is well worth considering for investing 5% of an overall portfolio &lt;a href=&quot;\/rogue-trader\/making-a-golden-choice\/&quot; class=&quot;readmore&quot;&gt;Read More…&lt;\/a&gt;","post_terms":"[]","guid":"http:\/\/www.marketmasterclass.com\/?p=272808","post_fmeta":null,"featured_image":"http:\/\/www.marketmasterclass.com\/wp-content\/uploads\/2016\/05\/gold-bullion.jpg"}]